# Задача 1. Вариант 37
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Арнольд Фит фон Гальсенау. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Ivanov. D. A.
# 29.03.2016

print ("Арнольд Фит фон Гальсенау известен под псевдонимом Ренн Людвиг, является неменцким писателем")
input ('\nНажмите Enter для выхода.')