# Задача 2. Вариант 37
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Иларион (Домрачев). Не забудьте о
# том, что автор должен быть упомянут на отдельной строке.

# Ivanov. D. A.
# 29.03.2016

print ("…когда Святый Дух восхощет вселиться в человека, то прежде всего возбудит в нем именно эти чувства. Человек узнает от Духа Божия свою совершенную нищету и убожество духовное; исчезнет в бездне самоосуждения, как капля в море: смирится не на словах только, а в чувстве сердца своего — истинно и действительно.")
print ('\n\t\t\tИларион (Домрачев)')
input ('\nНажмите Enter для выхода.')
